of222/tutorials/rheoTestFoam/FENE-CR/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{ 

                type             FENE-CR;

                etaS             etaS [1 -1 -1 0 0 0 0] 0.1;
		etaP             etaP [1 -1 -1 0 0 0 0] 0.9;                               
                lambda           lambda [0 0 1 0 0 0 0] 1;
                L2               L2     [0 0 0 0 0 0 0] 100;
                solveInTau       true;
                modifiedForm     false;
                
	    //  Place-holder variables in rheoTestFoam
                uTauCoupling     false;
                rho              rho [1 -3 0 0 0 0 0] 0.; 
          
}

rheoTestFoamParameters
{
              // Ramp mode (true) or transient mode (false)
                ramp 		 true; 

              // This tensor multiplied by gammaEpsilonDot gives nabla(U)
                gradU            ( 1.    0.    0.
                                   0.   -0.5   0.
                                   0.    0.   -0.5); 

              // Either strain rate or extensional rate (1/s) list (if ramp=false, only the first value in the list is read) 
                gammaEpsilonDotL 
                  (     
                        0.01
			0.02
			0.03
			0.04
			0.05
			0.06
			0.07
			0.08
			0.09
			0.1
			0.15
			0.2
			0.25
			0.3
			0.35
			0.4
			0.45
			0.5
			0.55
			0.6
			0.65
			0.7
			0.75
			0.8
			0.85
			0.9
			0.95
			1
			1.25
			1.5
			1.75
			2
			2.25
			2.5
			2.75
			3
			3.25
			3.5
			3.75
			4
			4.25
			4.5
			4.75
			5
			5.25
			5.5
			5.75
			6
			6.25
			6.5
			6.75
			7
			7.25
			7.5
			7.75
			8
			8.25
			8.5
			8.75
			9
			9.25
			9.5
			9.75
			10
			20
			30
			40
			50
			60
			70
			80
			90
			100
 
                
                  );
}
// ************************************************************************* //
